[
    {
        "query": "Vivo 5G mobiles with curved display",
        "product_title": "vivo V25 Pro 5G (sailing blue, 128 GB)",
        "base_price": 39999,
        "final_price": 29400,
        "Product_Opinion_Summary": "The vivo V25 Pro 5G, available in sailing blue, is a multitasker's dream with its impressive 16.66 cm (6.56 inch) Full HD+ AMOLED display and quick 120 Hz refresh rate, making entertainment and productivity a seamless experience. This dual-SIM smartphone, powered by the Mediatek Dimensity 1300 octa-core processor with a primary clock speed of 3 GHz, offers 128 GB of internal storage and 8 GB of RAM, providing ample space and speed for multitasking. The vivo V25 Pro 5G's triple rear camera setup (64MP + 8MP + 2MP) and 32MP front camera capture mesmerising pictures with outstanding graphics, making it a top choice for photography enthusiasts. The device's long-lasting 4830 mAh battery with 66W Fast Charging ensures uninterrupted usage throughout the day. While some users praise the phone's excellent performance and top-notch display, others find the processor average. Overall, the vivo V25 Pro 5G is a well-rounded smartphone with a beautiful design, impressive camera capabilities, and a long-lasting battery, making it an excellent value for its price."
    },
    {
        "query": "Vivo 5G mobiles with curved display",
        "product_title": "vivo T1 5G (Starlight Black, 128 GB)",
        "base_price": 19990,
        "final_price": 15990,
        "Product_Opinion_Summary": "The vivo T1 5G (Starlight Black, 128 GB) is a stylish and powerful smartphone that offers a thrilling user experience, improved mobile performance, and smooth gaming. With its 16.72 cm (6.58) FHD in-cell display, users can enjoy stunning visuals, while the 50 MP Main Camera enables them to capture high-quality photos. The device's 5000 mAh battery ensures long-lasting usage, making it an ideal companion for busy working schedules or business trips. The vivo T1 5G runs on Android 12 and is powered by a Qualcomm Snapdragon 695 octa-core processor, delivering impressive performance. The device comes with 4 GB RAM and 128 GB internal storage, expandable up to 1 TB via a hybrid MicroSD card slot. The triple-camera setup on the rear and the 16MP selfie camera cater to photography enthusiasts. Connectivity options include 5G, 4G, 3G, 2G networks, Wi-Fi, Bluetooth v5.1, GPS, and a 3.5mm audio jack. The device measures 75.84 mm in width, 164 mm in height, 8.25 mm in depth, and weighs 187 g. It comes with a 5000 mAh battery and supports 18W fast charging. Overall, the vivo T1 5G has received overwhelmingly positive reviews, with users praising its design, performance, and battery life. However, some users have noted that the touch screen response could be faster. Despite this minor drawback, the vivo T1 5G is an excellent choice for those seeking a powerful and feature-rich smartphone at an affordable price."
    },
    {
        "query": "Vivo 5G mobiles with curved display",
        "product_title": "vivo V23 5G (Sunshine Gold, 128 GB)",
        "base_price": 34990,
        "final_price": 29990,
        "Product_Opinion_Summary": "The vivo V23 5G, available in Sunshine Gold, is a stylish and powerful smartphone that boasts an impressive 16.36 cm (6.44 inch) Full HD+ AMOLED display with a 20:09 aspect ratio, 91.04% screen-to-body ratio, and a resolution of 2400x1080 pixels. Powered by the Mediatek Dimensity 920 octa-core processor with a primary clock speed of 2.5 GHz, this device offers lag-free gaming and smooth browsing. With 8 GB RAM and 128 GB internal storage, expandable up to 1 TB via a microSD card, the vivo V23 5G provides ample space for all your files and apps. The triple rear camera setup, featuring a 64 MP primary sensor, an 8 MP secondary sensor, and a 2 MP tertiary sensor, offers a range of features like Eye Autofocus, Night, Ultra-Wide Night, Super Macro, Bokeh Portrait, Portrait Filters, Bokeh Flare Portrait, High Resolution, Live Photo, AR Stickers, Slo-Mo, Time-Lapse, Dual-View Video, Double Exposure, Documents, Pano, Pro, and Ultra Stabilization. The 50 MP + 8 MP dual front camera setup comes with features like Autofocus, AI Extreme Night, Steadiface Selfie Video, Multi-Style Portrait, Double Exposure, Video Face Beauty, Dual-View Video, Slo-Mo, High Resolution, Live Photo, AR Stickers, Natural Portrait, and Dual Tone Spotlight Flash. Connectivity options include 5G, 4G, 3G, 2G, Wi-Fi, Bluetooth v5.2, NFC, USB Tethering, Infrared, and a 3.5mm audio jack. The device is equipped with sensors like an Accelerometer, Ambient Light Sensor, Proximity Sensor, E-Compass, Fingerprint Sensor (In Display), and a Gyroscope. The vivo V23 5G measures 72.42 mm in width, 157.2 mm in height, 7.55 mm in depth, and weighs 181 g. The device is backed by a 1-year warranty for the handset and a 6-month warranty for accessories. According to numerous reviews, the vivo V23 5G's standout feature is its exceptional camera quality, with users praising its ability to capture professional-looking pictures every day, thanks to its 50 MP front camera and 64 MP night camera. Overall, the vivo V23 5G is a well-rounded smartphone that delivers on both style and substance, making it an excellent choice for anyone in the market for a new device."
    },
    {
        "query": "Durable badminton rackets",
        "product_title": "COSCO CB-80 For ( Kids ) Multicolor Strung Badminton Racquet (Pack of: 2, 100g) Multicolor Strung Badminton Racquet",
        "base_price": 780,
        "final_price": 660,
        "Product_Opinion_Summary": "The COSCO CB-80 Multicolor Strung Badminton Racquet is a popular training set for kids, available in a pack of 2, each coming with a full cover for protection. With an isometric head shape and a head size of 95.5 sq/in, these badminton rackets offer a great balance and excellent performance. The shaft, made from tempered steel, is both flexible and durable. The grip size is G4, measuring 8.25 cm, and the racquets feature a 5 mm beam width and a height of 22 inches. While most reviewers praise the quality and durability of these badminton rackets, some mention that they are slightly smaller in size compared to other brands. Overall, the COSCO CB-80 Multicolor Strung Badminton Racquet is a good investment for parents looking for affordable, high-quality training equipment for their kids."
    },
    {
        "query": "Durable badminton rackets",
        "product_title": "LI-NING G-Force 3800 Superlite Blue, Brown Strung Badminton Racquet",
        "base_price": 4490,
        "final_price": 1949,
        "Product_Opinion_Summary": "The Li-Ning G-Force 3800 Superlite Blue, Brown Strung Badminton Racquet is a high-performance advanced level badminton racquet, ideal for senior players. Its unique Japanese Ultra-Carbon Graphite material provides strength and rigidity, helping to avoid frame deformation and ensuring more accurate attack points. The UHB Shaft, engineered with cutting-edge technology, optimizes shaft performance and improves smash performance with its frontal bending point. The racquet boasts an oval shape head with a size of 53.5 sq/in and a grip size of G2 - 9.52 cm. The Aero Tec Beam System (ATBS) minimizes air resistance while maintaining frame strength, while the Dynamic Optimum Frame (DOF) design enhances the racket's mechanical structure for more efficient attack and defense. The racquet measures 26.7 inches in height and 7 mm in beam width. Many reviewers praise the racquet's power on smashes due to its lightweight and head-heavy design, making it an excellent choice for offensive players, especially those playing on the back of the court. However, some users have noted the lower grip size, which can be addressed by adding external grips. The racquet's average rating of 4.2 is a testament to its overall quality, with many reviewers expressing satisfaction with its touch, feel, and performance. However, one user reported receiving a broken racquet, and the replacement policy was not applicable. Overall, the Li-Ning G-Force 3800 Superlite Blue, Brown Strung Badminton Racquet is a powerful and efficient badminton racquet that delivers on its promise of fast reaction times and quick decisive play."
    },
    {
        "query": "Durable badminton rackets",
        "product_title": "CLOVERBYTE Multicolour Badminton kit Set Of 2 Piece Racquet with 6 Piece Plastic ShuttleCock And Badminton Net Badminton Kit",
        "base_price": 899,
        "final_price": 398,
        "Product_Opinion_Summary": "The CLOVERBYTE Multicolour Badminton kit Set Of 2 Piece Racquet with 6 Piece Plastic ShuttleCock And Badminton Net is a popular badminton set that comes with 2 multicolour badminton racquets, 6 pieces of nylon shuttlecocks, and a badminton net. The racquets are constructed from durable iron, while the shuttlecocks are made of long-lasting nylon material. The set's dimensions include a net width of 20 cm, height of 70 cm, and depth of 4 cm, providing ample space for an enjoyable and competitive game. The product has received mixed reviews, with some customers praising its quality and affordability, while others have reported issues with the durability of the racquets. Overall, the set is ideal for players of all ages and skill levels, and its multicolor design adds a fun and vibrant touch to the game. However, it's important to note that this product does not allow for cancellations after 24 hours of order booking. While some customers have had positive experiences with the set, others have reported issues with the racquets breaking after only a few uses. Therefore, potential buyers should carefully consider the product's durability before making a purchase."
    },
    {
        "query": "best laptop with best specifications under 1,00,000",
        "product_title": "ASUS Vivobook 16 (2023) Ryzen 5 Hexa Core 7530U - (16 GB/512 GB SSD/Windows 11 Home) M1605YA-MB541WS Laptop",
        "base_price": 74990,
        "final_price": 59990,
        "Product_Opinion_Summary": "The ASUS Vivobook 16 (2023) Ryzen 5 Hexa Core 7530U laptop is a powerful and versatile device that delivers exceptional multitasking capabilities and a visually stimulating environment. With its AMD Ryzen 5 Hexa Core 7530U processor, 16 GB DDR4 RAM, and 512 GB SSD, this laptop is suitable for a wide range of applications, from everyday use to editing and gaming. The 16-inch FHD+ display boasts a 16:10 aspect ratio, LED Backlit LCD, IPS-level Panel, Anti-glare display, 300nits Brightness, TUV Rheinland-certified, and an 86 % Screen-to-body ratio, making it perfect for artistic and professional tasks. The laptop's connectivity options include one USB 2.0 Type-A, one USB 3.2 Gen 1 Type-C, and two USB 3.2 Gen 1 Type-A ports. Customers have praised the laptop's smoothness in performance, display quality, and overall handling. However, some users have noted that the memory space is less than 1TB and that the plastic body is delicate to handle. Despite this, the laptop's average rating of 4.2 speaks to its overall value and positive sentiment among users."
    },
    {
        "query": "best laptop with best specifications under 1,00,000",
        "product_title": "HP Envy x360 Creator OLED Eyesafe Intel Evo Intel Core i7 12th Gen 1255U - (16 GB/1 TB SSD/Windows 11 Home) 15-ew0048TU Thin and Light Laptop",
        "base_price": 135900,
        "final_price": 121900,
        "Product_Opinion_Summary": "The HP Envy x360 Creator OLED Eyesafe Intel Evo laptop offers a stunning visual experience with its 15.6-inch Full HD OLED display, delivering vivid, deep colours and flicker-free images. Powered by an Intel Core i7 12th Gen 1255U processor and integrated Intel Iris Xe graphics, this laptop delivers impressive performance for processing and multitasking. However, some users have reported issues with the sound output, which they found to be lower than expected. Additionally, a few users have encountered manufacturing defects, such as misaligned bezels and noises upon opening or closing the laptop. Despite these concerns, the majority of users praise the laptop's sleek design and excellent screen quality. Overall, the HP Envy x360 Creator OLED Eyesafe Intel Evo laptop is a powerful and visually impressive device, but potential buyers should be aware of the reported issues with sound output and manufacturing defects"
    },
    {
        "query": "best laptop with best specifications under 1,00,000",
        "product_title": "HP 15s (2023) Athlon Dual Core 3050U - (8 GB/512 GB SSD/Windows 11 Home) 15s-ey1509AU Thin and Light Laptop",
        "base_price": 35147,
        "final_price": 31990,
        "Product_Opinion_Summary": "The HP 15s (2023) Athlon Dual Core 3050U laptop, model number 15s-ey1509AU, is a budget-friendly, thin and light device suitable for day-to-day multitasking. Powered by an AMD Athlon Dual Core processor with a clock speed of 2.3 GHz and Turbo Boost up to 3.2 GHz, it comes with 8 GB DDR4 RAM, a 512 GB SSD, and an AMD Radeon Graphics Processor. The 15.6-inch HD display boasts a resolution of 1366 x 768 pixels, 250 nits brightness, and a color gamut of 45%NTSC. Connectivity options include one USB Type-C 5Gbps port, two USB Type-A 5Gbps ports, a Realtek RTL8822CE 802.11a/b/g/n/ac (2x2) wireless LAN, and Bluetooth v5.0. The laptop weighs 1.69 kg and includes an HP True Vision 720p HD camera, a full-size natural silver keyboard with a numeric keypad, and a 1-year onsite warranty for manufacturing defects. According to customer reviews, this laptop is a decent deal for the price, offering moderate performance suitable for word processing, Excel work, and small office tasks. The AMD Radeon graphics processor enhances the multimedia experience. However, some users have noted that the display quality leaves room for improvement, and battery performance is a standout feature. Overall, the HP 15s (2023) Athlon Dual Core 3050U is a solid choice for those seeking an affordable, efficient laptop for everyday use."
    },
    {
        "query": "rc car",
        "product_title": "StarsOne Remote Control Car 360 Degree Rotation Racing Car, Rc Cars Flip and Roll, Stunt Car Toy for Kids",
        "base_price": 999,
        "final_price": 445,
        "Product_Opinion_Summary": "The StarsOne Remote Control Car is a captivating 360-degree rotation racing toy for kids aged 3 and above. Measuring 10 inches in width and 7 inches in height, this rechargeable, ready-to-run RC car boasts a sleek plastic design, weighing 200g. The car comes pre-assembled, eliminating the need for any additional setup. Powered by 3 x AAA batteries (not included), it delivers thrilling stunts with its 360-degree rotation capability, allowing for endless flips and rolls. The durable plastic material ensures longevity and resistance to wear and tear, making it a worthwhile investment for parents. While some users praise its value for money and excellent performance, others find it lacking in volume control. Overall, the StarsOne Remote Control Car receives a 3.9-star average rating, with a majority of users expressing positive sentiments towards its exciting features and kid-friendly design."
    },
    {
        "query": "rc car",
        "product_title": "La Forme Camera car for LH App Android Remote Control rc camera toy car Rechargeable Car",
        "base_price": 3999,
        "final_price": 3059,
        "Product_Opinion_Summary": "The La Forme Camera car is a versatile and feature-rich RC toy car that offers both remote control and app control functionality, making it an excellent choice for children and adults alike. Its advanced features include anti-skid tires, shock absorbers, and an anti-collision beam, allowing it to navigate various terrains like roads, highways, shallow sand, and mud. The car's body is made of durable PVC material, and it comes with a hard plastic body, 500 megapixel WiFi camera, and 500mAh Ni-MH rechargeable battery, providing up to 20-25 minutes of playtime on a full charge. The car's dimensions measure 12 inches in width, 6 inches in height, and 12 cm in depth, with a weight of 485 g. However, some customers have reported issues with the battery life, which may not last as long as advertised. Additionally, a few users have expressed disappointment with the product's overall quality, describing it as low class and overpriced. Despite these concerns, the majority of reviews praise the car's durability, ease of use, and fun factor, making it a great gift option for all ages. Overall, the La Forme Camera car offers a unique blend of advanced features, durability, and entertainment value, making it a worthwhile investment for those seeking a high-performance RC toy car."
    },
    {
        "query": "rc car",
        "product_title": "Goyal's Remote Control RC Stunt Car Vehicle 360° Rotating Rolling Radio Control Race Car",
        "base_price": 999,
        "final_price": 435,
        "Product_Opinion_Summary": "The Goyal's Remote Control RC Stunt Car is a captivating 360° rotating rolling radio control race car that offers both remote and radio control features, making it an excellent choice for children aged 3 years and above. With a sleek design and durable plastic material construction, this rechargeable RC stunt car measures 6 inches in width and 4 inches in height, weighing 400 grams. The car's double-sided rotating design and 360-degree stunt spins and flips add to its appeal, allowing users to maneuver it forward, backward, left, and right with ease. However, some users have reported issues with the battery life, with the car only lasting for a few minutes after charging for an hour. Despite this, the majority of reviews are positive, with users praising the car's flexibility and speed. Overall, the Goyal's Remote Control RC Stunt Car is a fun and engaging toy, but potential buyers should be aware of the battery life concerns before making a purchase."
    },
    {
        "query": "good 5G laptops",
        "product_title": "MSI Bravo 15 AMD Ryzen 5 Hexa Core AMD R5-5600H - (8 GB/512 GB SSD/Windows 11 Home/4 GB Graphics/AMD Radeon RX 5500M/144 Hz) Bravo 15 B5DD-410IN Gaming Laptop",
        "base_price": 72990,
        "final_price": 48199,
        "Product_Opinion_Summary": "The MSI Bravo 15 Ryzen 5 laptop is a powerful and stylish device that delivers impressive performance for both gaming and productivity tasks. With its AMD Ryzen 5 Hexa Core AMD R5-5600H processor, 8 GB DDR4 RAM, and dedicated AMD Radeon RX 5500M graphics card, this laptop can handle demanding applications and games with ease. The 15.6-inch Full HD IPS-Level display with a refresh rate of 144 Hz and a screen resolution of 1920 x 1080 pixels offers high-quality and flicker-free visuals, making it an excellent choice for gamers and professionals alike. The laptop's cooling solution ensures that it remains cool and noise-free even during long gaming or work sessions. However, some users have reported that the battery life is on the lower side. The laptop's sleek black design, full-sized keyboard, and connectivity options, including Wi-Fi 6E, Bluetooth v5.1, and an RJ45 Ethernet port, add to its appeal. Overall, the MSI Bravo 15 B5DD-410IN is a high-performance laptop that offers excellent value for money, making it a top choice for those looking for a powerful and versatile device within a budget."
    },
    {
        "query": "good 5G laptops",
        "product_title": "ASUS Vivobook Pro 15 OLED Intel Core i5 12th Gen 12450H - (16 GB/512 GB SSD/Windows 11 Home/4 GB Graphics/NVIDIA GeForce RTX 3050) K6500ZC-L502WS Gaming Laptop",
        "base_price": 110990,
        "final_price": 89990,
        "Product_Opinion_Summary": "The Asus Vivobook Pro 15 OLED laptop, featuring an Intel Core i5 12th Gen processor, 16 GB LPDDR5 RAM, a 512 GB SSD, and a 15.6-inch 1920 x 1080 FHD OLED display with a 16:9 aspect ratio, 600nits HDR peak brightness, 100% DCI-P3 color gamut, and a 0.2ms response time, delivers an impressive user experience. Its dynamic processor and NVIDIA GeForce RTX 3050 GPU provide excellent performance for multitasking and casual gaming. The laptop's OLED display boasts fantastic color accuracy, detail, and brightness, making it a top choice for content creators and professionals. The laptop's 70 Wh battery offers a good battery life for a busy lifestyle, while its 3D Noise Reduction Technology enhances camera image quality. Users praise the laptop's build quality, display quality, and performance. However, some note that the sound loudness could be improved, and the laptop's price tag is considered high by a few. Overall, the Asus Vivobook Pro 15 OLED laptop is a well-rounded, high-performance device that offers excellent value for its price."
    },
    {
        "query": "good 5G laptops",
        "product_title": "MSI GF63 Intel Core i5 11th Gen 11400H - (16 GB/512 GB SSD/Windows 11 Home/4 GB Graphics/NVIDIA GeForce GTX 1650/60 Hz) GF63 Thin 11SC-1400IN Gaming Laptop",
        "base_price": 70990,
        "final_price": 53990,
        "Product_Opinion_Summary": "The MSI GF63 Thin 11SC-1400IN Intel Core i5 Gaming Laptop offers a balanced blend of power and portability, making it an excellent choice for occasional or light gamers, as well as those who require a high-performance laptop for daily tasks. The laptop's Intel Core i5 11th Gen 11400H processor delivers impressive performance, while the 16GB DDR4 RAM ensures smooth multitasking. The 512GB SSD offers ample storage, expandable up to 64GB, and the 39.62 cm (15.6 Inch) Full HD, 60Hz IPS-Level display delivers crisp visuals. The laptop's GeForce GTX 1650 graphics card with 4GB GDDR6 dedicated memory handles basic gaming well, with PUBG playing smoothly. However, some users have noted that the laptop can heat up during intense gaming sessions, and the battery life may not be sufficient for long gaming sessions. The laptop's design is sleek and stylish, making it a great fit for both office and gaming environments. Overall, the MSI GF63 Thin 11SC-1400IN Intel Core i5 Gaming Laptop is a solid choice for those seeking a powerful and portable laptop for everyday use and occasional gaming."
    },
    {
        "query": "phones with good camera, good performance, 5G connectivity, and under 25000",
        "product_title": "OnePlus Nord CE 5G (Charcoal Ink, 128 GB)",
        "base_price": 22999,
        "final_price": 22989,
        "Product_Opinion_Summary": "The OnePlus Nord CE 5G is an impressive mid-range smartphone that offers a great balance of features and affordability. With a 6.43-inch, 90Hz fluid AMOLED display and a resolution of 2400 x 1080 pixels, this phone delivers crisp visuals and smooth scrolling. Under the hood, the Qualcomm Snapdragon 750G 5G mobile platform powers the device, featuring an octa-core processor, Kryo 570 CPU, and an Adreno 619 GPU. The phone comes with 8GB RAM and 128GB internal memory on UFS 2.1 storage system, providing ample space for your media and applications. The triple rear camera setup, consisting of a 64MP primary sensor, an 8MP ultra-wide-angle lens, and a 2MP depth sensor, captures stunning photos and 1080p videos at 30/60 fps. The 16MP front camera is perfect for selfies and video calls. The device supports dual 4G SIM cards or a single 5G SIM + 4G SIM, making it versatile for various connectivity needs. The 4500mAh battery ensures long-lasting usage, and the Warp Charge 30T power adapter ensures quick charging. Overall, the OnePlus Nord CE 5G is an excellent choice for those seeking a feature-rich, affordable 5G smartphone. While some users have reported minor issues with software updates, the majority of reviews praise the phone's performance, camera quality, and value for money."
    },
    {
        "query": "phones with good camera, good performance, 5G connectivity, and under 25000",
        "product_title": "SAMSUNG Galaxy F34 5G (Mystic Green, 128 GB)",
        "base_price": 25999,
        "final_price": 18499,
        "Product_Opinion_Summary": "The Samsung Galaxy F34 5G, available in Mystic Green with a 128GB storage capacity, is a mid-range smartphone that delivers satisfactory performance, a superb display, good cameras, and great battery life. Its elegant design, while not fancy or premium, is appreciated by many. The 6.5-inch Full HD+ Super AMOLED display with a 120Hz refresh rate offers excellent brightness and quality. The phone's 6000mAh battery provides stable battery life, lasting up to 5 hours of continuous use on a single charge. The Exynos 1280 Octa Core processor delivers consistent performance without getting warm. The primary camera setup, featuring a 50MP (OIS) + 8MP + 2MP triple camera, takes satisfactory photos, while the 13MP front camera is average. Connectivity features include 5G, 4G LTE, 3G, and 2G networks, Bluetooth v5.3, Wi-Fi 802.11 a/b/g/n/ac, NFC, USB tethering, and a 3.5mm audio jack. Additional features include a fingerprint sensor, accelerometer, gyro sensor, geomagnetic sensor, light sensor, virtual proximity sensing, OneUI 5.1, and support for 56 languages. The device measures 77.2 mm in width, 161.7 mm in height, and 8.8 mm in depth, weighing 208 g. With a 1-year manufacturer warranty for the device and 6 months for in-box accessories, the Samsung Galaxy F34 5G is a solid choice for those looking for a good phone under 20,000 Rupees, especially during sales or with exchange offers. However, some users have reported average battery performance and network connectivity issues."
    },
    {
        "query": "phones with good camera, good performance, 5G connectivity, and under 25000",
        "product_title": "MOTOROLA g82 5G (Meterorite Grey, 128 GB)",
        "base_price": 25999,
        "final_price": 21499,
        "Product_Opinion_Summary": "The Moto G82 5G, available in Meterorite Grey, is a sleek and premium-looking smartphone with a stunning 16.76 cm (6.6 inch) Full HD+ pOLED display that delivers rich and vibrant colors for an immersive visual experience. Powered by a Qualcomm Snapdragon 695 5G processor with an octa-core CPU and a primary clock speed of 2.2 GHz, this device offers smooth and efficient performance for multitasking and gaming. With 8 GB RAM and 128 GB internal storage, expandable up to 1 TB via a hybrid MicroSD card slot, the Moto G82 5G provides ample space for all your files and applications. The triple rear camera setup, including a 50MP primary sensor with OIS, an 8MP ultra-wide-angle and depth camera, and a 2MP macro camera, captures stunning images with fantastic clarity. The 16MP front-facing camera supports portrait mode and HDR for impressive selfies. Connectivity options include 5G, 4G, 3G, 2G networks, Wi-Fi 802.11 a/b/g/n/ac (2.4 GHz | 5 GHz), Bluetooth v5.1, NFC, USB, and a 3.5mm audio jack. The device features dual speakers with Dolby Atmos, a side-mounted fingerprint sensor with power touch, and face unlock for added security. With a water-resistant IP52 rating, a 5000 mAh battery, and a 33W charger, the Moto G82 5G offers long-lasting battery life and quick charging capabilities. The device supports GPS, A-GPS, LTEPP, SUPL, GLONASS, and GALILEO. Overall, the Moto G82 5G is a well-rounded smartphone that offers excellent value for money with its impressive display, powerful performance, versatile camera system, and long-lasting battery life. While some users have noted that the audio performance could be improved, the majority of reviews praise the device for its sleek design, smooth performance, and impressive features."
    },
    {
        "query": "best 5G mobile with good camera and high performance under 25000",
        "product_title": "OnePlus Nord CE 2 5G (Bahama Blue, 128 GB)",
        "base_price": 24999,
        "final_price": 24499,
        "Product_Opinion_Summary": "The OnePlus Nord CE 2 5G Smartphone, available in the Bahama Blue color with a 16.33 cm (6.43 inch) 2400 x 1080 pixels AMOLED display, offers a seamless blend of style and functionality. Powered by a Mediatek processor with a dual-core primary clock speed of 2.4 GHz, this device boasts an impressive 8 GB RAM and 128 GB internal storage, expandable via a dedicated memory card slot. With a 64MP primary rear camera and a 4500 mAh battery capacity, the Nord CE 2 5G is an excellent choice for capturing clear and detailed images and ensuring non-stop streaming, entertainment, and work. The device's 90 Hz AMOLED display ensures interruption-free and smooth operation at all times, making it an ideal companion for your fast-paced lifestyle. Based on customer reviews, the Nord CE 2 5G has received overwhelmingly positive feedback, with users praising its 'good' to 'very good' performance, 'nice' color, 'perfect' sound, and 'superb' quality. With a 5G network capability and a 1-year warranty, the OnePlus Nord CE 2 5G is a smartphone that delivers on both style and substance."
    },
    {
        "query": "best 5G mobile with good camera and high performance under 25000",
        "product_title": "SAMSUNG Galaxy F14 5G (B.A.E. Purple, 128 GB)",
        "base_price": 17490,
        "final_price": 13990,
        "Product_Opinion_Summary": "The Samsung Galaxy F14 5G, available in the B.A.E. Purple color, is a dual-SIM smartphone with a 16.76 cm (6.6 inch) Full HD+ LCD Display, powered by an Exynos 1330, Octa Core processor, and runs on the Android 13 operating system. It comes with 4 GB RAM and 128 GB internal storage, expandable up to 1 TB via a dedicated MicroSD card slot. The primary camera setup includes a 50MP main camera and a 2MP secondary camera, while the front-facing camera is a 13MP Fixed Focus lens. Connectivity features include 5G, 4G LTE, 3G, and 2G networks, Wi-Fi, Bluetooth v5.2, and a 3.5mm audio jack. The device also includes sensors such as an accelerometer, fingerprint sensor, gyro sensor, geomagnetic sensor, light sensor, and proximity sensor. With a 6000 mAh Lithium Ion battery and a 1-year manufacturer warranty for the device and a 6-month manufacturer warranty for in-box accessories, the Samsung Galaxy F14 5G is a solid choice for those looking for a budget-friendly 5G smartphone. However, some users have reported that the phone lags and the camera quality is not up to par, especially in low light conditions. Additionally, some were disappointed that no charger or protective cover was included in the box. Overall, the Samsung Galaxy F14 5G receives positive reviews for its design, performance, and camera, but some users caution against relying on Flipkart's exchange offers."
    },
    {
        "query": "best 5G mobile with good camera and high performance under 25000",
        "product_title": "IQOO Z7S 5G (Norway Blue, 128 GB)",
        "base_price": 23999,
        "final_price": 18412,
        "Product_Opinion_Summary": "The IQOO Z7S 5G, available in Norway Blue, is a mid-range smartphone that offers impressive features at an affordable price point. With a 6.4-inch FHD+ AMOLED display, this device boasts a vibrant and crisp visual experience. Powered by a Snapdragon 695 5G Mobile Processor, it ensures smooth multitasking and efficient power consumption. The 64MP OIS Ultra Stable Camera delivers excellent image quality, while the 16MP front camera caters to selfie enthusiasts. The 44W FlashCharge feature allows for a 50% charge in just 23 minutes, making it a convenient choice for those on the go. Gamers will appreciate the Ultra Game Mode, Motion Control, and 1200Hz Instant touch sampling rate for an immersive gaming experience. The device comes with 8 GB RAM and 128 GB internal storage, expandable via a dedicated memory card slot. While some users have noted that 4K resolution is not available on this phone, the overall sentiment towards the camera and battery performance is positive. Overall, the IQOO Z7S 5G is a solid mid-range option with a good balance of features, performance, and affordability."
    },
    {
        "query": "buy dhop",
        "product_title": "Skechers TRACK - KNOCKHILL Sneakers For Men",
        "base_price": 4999,
        "final_price": 3049,
        "Product_Opinion_Summary": "The Skechers TRACK - KNOCKHILL sneakers for men are a popular choice for those seeking stylish, comfortable footwear. With a sleek black color and breathable mesh outer material, these sneakers offer both comfort and versatility. Many reviewers praise the excellent quality and superior comfort, noting that they feel like wearing nothing at all. The relaxed fit caters to those with medium to high toe widths, ensuring a snug and secure fit. However, some users caution that the grip may not be sufficient for activities like biking. Overall, the Skechers TRACK - KNOCKHILL sneakers receive overwhelmingly positive reviews, with customers expressing their satisfaction with the comfort, quality, and value for money. Despite the occasional concern about grip, the majority sentiment suggests that these sneakers are an excellent addition to any casual wardrobe."
    },
    {
        "query": "buy dhop",
        "product_title": "Divine Blessings Hawan Dhoop / Humad for Puja & Havan - 400 Grams",
        "base_price": 350,
        "final_price": 163,
        "Product_Opinion_Summary": "The Divine Blessings Hawan Dhoop, or Humad, is a 400-gram package of traditional Hindu puja and havan materials from India, specifically the fragrant charcoal used for offering oblations during these rituals. This humad is a key component of the havan kund setup, providing a stable base for the offerings and releasing a pleasing aroma during the ritual. With a net weight of 400 grams, this Divine Blessings Hawan Dhoop offers ample material for multiple puja and havan ceremonies. The reviews for this product are generally positive, with some customers expressing that it does the job satisfactorily, while others find it to be a nice product. However, a few customers have described their experience as average. Overall, the sentiment towards this humad is neutral to positive, with an average rating of 4.1 out of 5 stars. While it may not be the most extraordinary humad on the market, it is a reliable and functional choice for those in need of puja and havan materials."
    },
    {
        "query": "buy dhop",
        "product_title": "Siddhbali 24 Sambrani Havan Cups With Pure Guggul Loban & Herbs Dhoop Non-Toxic 12x2 Pack Guggul Dhoop",
        "base_price": 395,
        "final_price": 194,
        "Product_Opinion_Summary": "The Siddhbali 24 Sambrani Havan Cups With Pure Guggul Loban & Herbs Dhoop Non-Toxic 12x2 Pack is a set of 24 non-toxic Guggul Loban Havan Cups with stands, infused with the invigorating fragrance of Guggul. Each 2-inch long, brown cup has a burning time of 30 minutes and is made from wood powder, Loban, Guggul, and herbs. However, the product has received mixed reviews, with some customers praising its ability to uplift the positive energy level and create a pleasant environment. Others, unfortunately, have reported issues with the product's quality. Some cups arrived broken, while others failed to burn properly, resulting in a waste of money. Additionally, some customers found the smell to be unpleasant. Despite these negative experiences, there are also positive reviews, with some customers expressing their satisfaction with the product. Overall, the Siddhbali 24 Sambrani Havan Cups With Pure Guggul Loban & Herbs Dhoop Non-Toxic 12x2 Pack is an intriguing addition to any religious or spiritual practice, but potential buyers should be aware of the inconsistencies in quality reported by some customers. The product is proudly made in India and includes a net quantity of 24 cups in the box."
    },
    {
        "query": "best 5G mobile under 15000 with good camera and great performance from Realme",
        "product_title": "realme 10 Pro 5G (Hyperspace, 128 GB)",
        "base_price": 20999,
        "final_price": 18999,
        "Product_Opinion_Summary": "The realme 10 Pro 5G (Hyperspace, 128 GB) is a high-performance smartphone that boasts an impressive 17.07 cm (6.72 inch) Full HD+ LCD Display with a 120 Hz refresh rate and a 20:9 aspect ratio. Powered by a Qualcomm Snapdragon 695 5G Octa Core processor, it comes with 6 GB RAM and 128 GB internal storage, expandable up to 1 TB via a hybrid MicroSD card slot. The device's 108MP + 2MP dual rear camera setup and 16MP front camera offer exceptional photography and filmmaking abilities, with features like Night Scene Mode, Street Mode, and 108M Mode. The massive 8 GB + 8 GB Dynamic RAM design ensures smooth multitasking, gaming, and file access. The smartphone's 5000 mAh battery supports 33W Charging Power, and the device is compatible with 5G, 4G VoLTE, 4G LTE, WCDMA, GSM, and Wi-Fi 4 and 5. With a 240 Hz Touch Sampling Rate, COG Sealing Process, In-Cell Touch Panel Technology, and 10 Touch Points, the realme 10 Pro 5G delivers a fantastic user experience. While some users have noted the absence of an Amoled display and glass protection, the overall sentiment towards this device is overwhelmingly positive, with many praising its excellent camera quality, design, performance, and battery life."
    },
    {
        "query": "best 5G mobile under 15000 with good camera and great performance from Realme",
        "product_title": "realme 9 5G (Meteor Black, 64 GB)",
        "base_price": 18999,
        "final_price": 13999,
        "Product_Opinion_Summary": "The realme 9 5G (Meteor Black, 64 GB) is a powerful and efficient smartphone, boasting a 2.4 GHz Mediatek Dimensity 810 octa-core processor and a 6 nm architecture. Its 16.51 cm (6.5 inch) Full HD+ LCD display with a 90 Hz refresh rate and 90.50% screen-to-body ratio enhances visual and operational experiences. The 48MP main camera, 2MP portrait camera, and 2MP macro camera, along with the 16MP front-facing camera, deliver impressive image quality. The 4 GB RAM and 64 GB internal storage, expandable up to 1 TB via a dedicated MicroSD card slot, cater to extensive usage. The 5000 mAh Lithium Polymer battery ensures long-lasting performance. Users praise the phone's beautiful design, fantastic camera quality, and smooth 90Hz display. They also appreciate the device's good battery backup and decent charging time. Overall, the realme 9 5G (Meteor Black, 64 GB) is a solid choice for those seeking a reliable and feature-rich 5G smartphone at a reasonable price."
    },
    {
        "query": "best 5G mobile under 15000 with good camera and great performance from Realme",
        "product_title": "realme 11 Pro 5G (Astral Black, 128 GB)",
        "base_price": 25999,
        "final_price": 21999,
        "Product_Opinion_Summary": "The realme 11 Pro 5G is a stylish and impressive smartphone with a 120 Hz curved vision display that offers an immersive viewing experience. Powered by the Dimensity 7050 5G chipset, this smartphone delivers fast and efficient performance, making it perfect for gaming and multitasking. The 100 MP OIS ProLight camera captures stunning memories, while the 67 W SUPERVOOC charge ensures your phone is never out of power for long. With up to 12 GB + 12 GB of Dynamic RAM, this smartphone ensures smooth and fast operations. The 5000 mAh battery provides long-lasting battery life, and the device supports 5G, 4G VoLTE, 4G LTE, WCDMA, GSM, and Wi-Fi connectivity. The 17.02 cm (6.7 inch) Full HD+ OLED Display with a resolution of 2412 x 1080 pixels, a screen-to-body ratio of 93.6%, and a contrast ratio of 5000000:1 offers stunning visuals. The 100MP (OIS) + 2MP dual-camera system and 16MP front-facing camera capture high-quality images and videos. The device comes with a 1-year manufacturer warranty for the device and 6 months for in-box accessories. Based on customer reviews, the realme 11 Pro 5G has received overwhelmingly positive feedback, with users praising its stylish design, impressive performance, and high-quality camera system. The average rating for this smartphone is 4.4 out of 5 stars."
    },
    {
        "query": "Realme phones with good camera, great performance, and budget under 60000",
        "product_title": "realme C30 (Lake Blue, 32 GB)",
        "base_price": 9299,
        "final_price": 6499,
        "Product_Opinion_Summary": "The realme C30 (Lake Blue, 32 GB) is a budget-friendly smartphone that delivers impressive performance with its Unisoc T612 processor, enabling seamless multitasking. The 16.51 cm (6.5 inch) HD+ LCD Display boasts a resolution of 1600 x 720 pixels, an aspect ratio of 20:9, and a screen-to-body ratio of 88.70%, providing an immersive viewing experience. The 3 GB RAM and 32 GB internal storage, expandable up to 1 TB via a dedicated microSD card slot, offer ample space for your media and applications. The dual-SIM smartphone supports 4G VoLTE, 4G LTE, WCDMA, and GSM networks, ensuring reliable connectivity. The 8MP rear camera with an f/2.0 aperture and a 5MP front camera with an f/2.2 aperture capture stunning images with exceptional imagery, featuring various modes like Beauty, Filter, HDR, Panoramic View, Portrait, Timelapse, Expert, Super Night, and 20 Continuous Shots. The 5000 mAh battery supports 10 W Max Charging Power with reverse charging, providing long-lasting battery life. The realme C30 has received overwhelmingly positive reviews, with users praising its excellent value for money, impressive performance, and decent camera quality, making it a top choice for budget-conscious consumers."
    },
    {
        "query": "Realme phones with good camera, great performance, and budget under 60000",
        "product_title": "realme Narzo 30 Pro 5G (Blade Silver, 128 GB)",
        "base_price": 21999,
        "final_price": 17990,
        "Product_Opinion_Summary": "The realme Narzo 30 Pro 5G (Blade Silver, 128 GB) is a powerful and feature-rich smartphone that delights many users with its smooth gaming experience, impressive camera capabilities, and attractive design. Its 16.51 cm (6.5 inch) Full HD+ LCD In-cell Display with a 120 Hz refresh rate and 90.50% screen-to-body ratio offers an immersive viewing experience, while the MediaTek Dimensity 800U 5G Octa-core processor ensures quick and responsive performance. The 48MP main sensor, 8MP wide-angle lens, and 2MP macro lens in the primary camera setup and the 16MP front-facing camera capture high-quality photos and videos. The device's 5000 mAh battery supports 30W Dart Max Charging Power and reverse charging power, providing long-lasting battery life. However, some users have reported minor lagging issues, and the absence of a headphone jack might be a drawback for some. Overall, the realme Narzo 30 Pro 5G (Blade Silver, 128 GB) is an excellent choice for those seeking a budget-friendly 5G smartphone with impressive features and solid performance."
    },
    {
        "query": "Realme phones with good camera, great performance, and budget under 60000",
        "product_title": "realme Narzo N53 (Feather Gold, 128 GB)",
        "base_price": 12999,
        "final_price": 10318,
        "Product_Opinion_Summary": "The realme Narzo N53, available in Feather Gold with a generous 128GB ROM and 6GB RAM, offers a smooth multitasking experience and effortless app switching. Its 17.12 cm (6.74 inch) display boasts a resolution of 2400x1080 pixels and runs on Android 13.0. Powered by an Octa Core processor clocked at 1.8 GHz, this device delivers impressive performance. The 50MP Rear Camera with a Dual Camera Lens captures high-quality images, while the 5000 mAh battery ensures long-lasting usage. Customers praise its superb performance, calling it a 'super mobile' with 'good porfomens' and a 'nice product'. With 4G VOLTE connectivity and a 1-year warranty on the handset and a 6-month warranty on accessories, the realme Narzo N53 is a worthwhile investment for those seeking a powerful and feature-rich smartphone at an affordable price."
    }
]